In [ ]:
!pip install ipython-sql

!pip install mysqlclient

Looking in indexes: https://pypi.org/simple, https://us-python.pkg.dev/colab-wheels/public/simple/
Requirement already satisfied: ipython-sql in /usr/local/lib/python3.7/dist-packages (0.3.9)
Requirement already satisfied: prettytable in /usr/local/lib/python3.7/dist-packages (from ipython-sql) (3.4.1)
Requirement already satisfied: ipython-genutils>=0.1.0 in /usr/local/lib/python3.7/dist-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: sqlalchemy>=0.6.7 in /usr/local/lib/python3.7/dist-packages (from ipython-sql) (1.4.41)
Requirement already satisfied: ipython>=1.0 in /usr/local/lib/python3.7/dist-packages (from ipython-sql) (7.9.0)
Requirement already satisfied: sqlparse in /usr/local/lib/python3.7/dist-packages (from ipython-sql) (0.4.2)
Requirement already satisfied: six in /usr/local/lib/python3.7/dist-packages (from ipython-sql) (1.15.0)
Collecting jedi>=0.10
  Downloading jedi-0.18.1-py2.py3-none-any.whl (1.6 MB)
     |████████████████████████████████| 1.6 MB 5.2 MB/s
Requirement already satisfied: prompt-toolkit<2.1.0,>=2.0.0 in /usr/local/lib/python3.7/dist-packages (from ipython>=1.0->ipython-sql) (2.0.10)
Requirement already satisfied: traitlets>=4.2 in /usr/local/lib/python3.7/dist-packages (from ipython>=1.0->ipython-sql) (5.1.1)
Requirement already satisfied: decorator in /usr/local/lib/python3.7/dist-packages (from ipython>=1.0->ipython-sql) (4.4.2)
Requirement already satisfied: pygments in /usr/local/lib/python3.7/dist-packages (from ipython>=1.0->ipython-sql) (2.6.1)
Requirement already satisfied: pickleshare in /usr/local/lib/python3.7/dist-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: pexpect in /usr/local/lib/python3.7/dist-packages (from ipython>=1.0->ipython-sql) (4.8.0)
Requirement already satisfied: setuptools>=18.5 in /usr/local/lib/python3.7/dist-packages (from ipython>=1.0->ipython-sql) (57.4.0)
Requirement already satisfied: backcall in /usr/local/lib/python3.7/dist-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in /usr/local/lib/python3.7/dist-packages (from jedi>=0.10->ipython>=1.0->ipython-sql) (0.8.3)
Requirement already satisfied: wcwidth in /usr/local/lib/python3.7/dist-packages (from prompt-toolkit<2.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.2.5)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.7/dist-packages (from sqlalchemy>=0.6.7->ipython-sql) (1.1.3)
Requirement already satisfied: importlib-metadata in /usr/local/lib/python3.7/dist-packages (from sqlalchemy>=0.6.7->ipython-sql) (4.12.0)
Requirement already satisfied: zipp>=0.5 in /usr/local/lib/python3.7/dist-packages (from importlib-metadata->sqlalchemy>=0.6.7->ipython-sql) (3.8.1)
Requirement already satisfied: typing-extensions>=3.6.4 in /usr/local/lib/python3.7/dist-packages (from importlib-metadata->sqlalchemy>=0.6.7->ipython-sql) (4.1.1)
Requirement already satisfied: ptyprocess>=0.5 in /usr/local/lib/python3.7/dist-packages (from pexpect->ipython>=1.0->ipython-sql) (0.7.0)
Installing collected packages: jedi
Successfully installed jedi-0.18.1
Looking in indexes: https://pypi.org/simple, https://us-python.pkg.dev/colab-wheels/public/simple/
Collecting mysqlclient
  Downloading mysqlclient-2.1.1.tar.gz (88 kB)
     |████████████████████████████████| 88 kB 3.5 MB/s
Building wheels for collected packages: mysqlclient
  Building wheel for mysqlclient (setup.py) ... done
  Created wheel for mysqlclient: filename=mysqlclient-2.1.1-cp37-cp37m-linux_x86_64.whl size=99977 sha256=68b9102c8356865052e6f05548e2ff4352c025c538a2ec95502cc2b9ae5807a5
  Stored in directory: /root/.cache/pip/wheels/95/2d/67/2cb3f82e435fc8e055cb2761a15a0812bf086068f6fb835462
Successfully built mysqlclient
Installing collected packages: mysqlclient
Successfully installed mysqlclient-2.1.1

In [ ]:
%load_ext sql

In [ ]:

%sql mysql://badmstudent:badmstudent@badm-database.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306

'Connected: badmstudent@None'

In [ ]:
%sql show databases

 * mysql://badmstudent:***@badm-database.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306
7 rows affected.

[('information_schema',),
 ('Ch07_Review',),
 ('ch08_simpleco',),
 ('construct',),
 ('northwind',),
 ('sales',),
 ('yelp_champaign',)]

In [ ]:
#q1
%%sql 
use sales;
select CUS_FNAME, CUS_LNAME, C.CUS_CODE, SUM( L.LINE_PRICE)
FROM CUSTOMER C LEFT JOIN INVOICE I ON C.CUS_CODE= I.CUS_CODE
LEFT JOIN LINE L ON L.INV_NUMBER= L.INV_NUMBER
GROUP BY C.CUS_CODE, CUS_LNAME, CUS_FNAME

 * mysql://badmstudent:***@badm-database.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306
0 rows affected.
10 rows affected.

[('Alfred', 'Ramas', 10010, Decimal('684.23')),
 ('Leona', 'Dunne', 10011, Decimal('2052.69')),
 ('Kathy', 'Smith', 10012, Decimal('684.23')),
 ('Paul', 'Olowski', 10013, Decimal('684.23')),
 ('Myron', 'Orlando', 10014, Decimal('1368.46')),
 ('Amy', "O'Brian", 10015, Decimal('684.23')),
 ('James', 'Brown', 10016, Decimal('684.23')),
 ('George', 'Williams', 10017, Decimal('684.23')),
 ('Anne', 'Farriss', 10018, Decimal('684.23')),
 ('Olette', 'Smith', 10019, Decimal('684.23'))]

In [ ]:
#Q2
%%sql
USE sales;
SELECT L.INV_NUMBER
FROM LINE L LEFT JOIN INVOICE I ON L.INV_NUMBER= I.INV_NUMBER
GROUP BY L.INV_NUMBER
HAVING COUNT(P_CODE) > 2

 * mysql://badmstudent:***@badm-database.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306
0 rows affected.
3 rows affected.

[(1003,), (1006,), (1008,)]

In [ ]:
#Q3
%%sql
USE sales;
SELECT V_NAME
FROM VENDOR V LEFT JOIN PRODUCT P ON V.V_CODE= P.V_CODE
WHERE P.V_CODE IS NULL

 * mysql://badmstudent:***@badm-database.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306
0 rows affected.
5 rows affected.

[('SuperLoo, Inc.',),
 ('Dome Supply',),
 ('Brackman Bros.',),
 ('B&K, Inc.',),
 ('Damal Supplies',)]

In [ ]:
#Q4
%%sql
USE sales;
SELECT *
FROM PRODUCT
WHERE P_PRICE= (SELECT MIN(P_PRICE) FROM PRODUCT)

 * mysql://badmstudent:***@badm-database.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306
0 rows affected.
1 rows affected.

[('54778-2T', 'Rat-tail file, 1/8-in. fine', datetime.datetime(2013, 12, 15, 0, 0), 43, 20, Decimal('4.99'), Decimal('0.00'), 21344)]

In [ ]:
#Q5
%%sql
USE sales;
SELECT COUNT(P_CODE)
FROM PRODUCT
WHERE P_PRICE< (SELECT AVG(P_PRICE) FROM PRODUCT )

 * mysql://badmstudent:***@badm-database.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306
0 rows affected.
1 rows affected.

[(11,)]

In [ ]:
#Q6
%%sql
USE sales;
SELECT C.CUS_CODE, CUS_FNAME, CUS_LNAME, Count(INV_NUMBER)
FROM CUSTOMER C INNER JOIN INVOICE I ON C.CUS_CODE= I.CUS_CODE
GROUP BY C.CUS_CODE,

 * mysql://badmstudent:***@badm-database.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306
0 rows affected.
5 rows affected.

[(10011, 'Leona', 'Dunne', 3),
 (10012, 'Kathy', 'Smith', 1),
 (10014, 'Myron', 'Orlando', 2),
 (10015, 'Amy', "O'Brian", 1),
 (10018, 'Anne', 'Farriss', 1)]

In [ ]:
#Q7
%%sql
USE sales;
SELECT SUM(P_QOH * P_PRICE) AS TOTAL_VALUE
FROM PRODUCT

 * mysql://badmstudent:***@badm-database.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306
0 rows affected.
1 rows affected.

[(Decimal('15084.52'),)]

In [ ]:
#Q8
%%sql
USE sales;
SELECT V.V_CODE, SUM(P_QOH * P_PRICE) AS TOTAL_VALUE
FROM PRODUCT P INNER JOIN VENDOR V ON P.V_CODE= V.V_CODE
GROUP BY V.V_CODE

 * mysql://badmstudent:***@badm-database.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306
0 rows affected.
6 rows affected.

[(21225, Decimal('1431.13')),
 (21231, Decimal('2002.65')),
 (21344, Decimal('1009.07')),
 (23119, Decimal('1611.02')),
 (24288, Decimal('4305.47')),
 (25595, Decimal('3506.42'))]

In [ ]:
#Q9
%%sql
USE sales;
SELECT V.V_CODE, SUM(P_QOH * P_PRICE) AS TOTAL_VALUE
FROM PRODUCT P INNER JOIN VENDOR V ON P.V_CODE= V.V_CODE
GROUP BY V.V_CODE
HAVING TOTAL_VALUE > 2000.00

 * mysql://badmstudent:***@badm-database.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306
0 rows affected.
3 rows affected.

[(21231, Decimal('2002.65')),
 (24288, Decimal('4305.47')),
 (25595, Decimal('3506.42'))]

In [ ]:
%%sql
USE sales;
SELECT V_NAME, P_DESCRIPT
FROM VENDOR V LEFT JOIN PRODUCT P ON V.V_CODE= P.V_CODE
WHERE V_STATE ="FL"

 * mysql://badmstudent:***@badm-database.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306
0 rows affected.
5 rows affected.

[('SuperLoo, Inc.', None),
 ('B&K, Inc.', None),
 ('Rubicon Systems', 'Power painter, 15 psi., 3-nozzle'),
 ('Rubicon Systems', 'B&D cordless drill, 1/2-in.'),
 ('Rubicon Systems', 'Steel matting, 4\'x8\'x1/6", .5" mesh')]

In [ ]:
%%sql 
use sales;
select C.CUS_CODE, L.INV_NUMBER, INV_DATE, P_DESCRIPT,  LINE_UNITS, LINE_PRICE
FROM CUSTOMER C INNER JOIN INVOICE I ON C.CUS_CODE= I.CUS_CODE
INNER JOIN LINE L ON I.INV_NUMBER= L.INV_NUMBER INNER JOIN PRODUCT P ON L.P_CODE=P.P_CODE
ORDER BY CUS_CODE

 * mysql://badmstudent:***@badm-database.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306
0 rows affected.
18 rows affected.

[(10011, 1008, datetime.datetime(2014, 1, 17, 2, 0), 'Claw hammer', 1, Decimal('9.95')),
 (10011, 1002, datetime.datetime(2014, 1, 16, 1, 0), 'Rat-tail file, 1/8-in. fine', 2, Decimal('4.99')),
 (10011, 1004, datetime.datetime(2014, 1, 17, 0, 0), 'Rat-tail file, 1/8-in. fine', 3, Decimal('4.99')),
 (10011, 1004, datetime.datetime(2014, 1, 17, 0, 0), 'Claw hammer', 2, Decimal('9.95')),
 (10011, 1008, datetime.datetime(2014, 1, 17, 2, 0), 'PVC pipe, 3.5-in., 8-ft', 5, Decimal('5.87')),
 (10011, 1008, datetime.datetime(2014, 1, 17, 2, 0), 'Steel matting, 4\'x8\'x1/6", .5" mesh', 3, Decimal('119.95')),
 (10012, 1003, datetime.datetime(2014, 1, 16, 1, 0), '7.25-in. pwr. saw blade', 5, Decimal('14.99')),
 (10012, 1003, datetime.datetime(2014, 1, 16, 1, 0), 'B&D cordless drill, 1/2-in.', 1, Decimal('38.95')),
 (10012, 1003, datetime.datetime(2014, 1, 16, 1, 0), 'Hrd. cloth, 1/4-in., 2x50', 1, Decimal('39.95')),
 (10014, 1001, datetime.datetime(2014, 1, 16, 0, 0), 'Claw hammer', 1, Decimal('9.95')),
 (10014, 1006, datetime.datetime(2014, 1, 17, 2, 0), '1.25-in. metal screw, 25', 3, Decimal('6.99')),
 (10014, 1006, datetime.datetime(2014, 1, 17, 2, 0), 'B&D jigsaw, 12-in. blade', 1, Decimal('109.92')),
 (10014, 1006, datetime.datetime(2014, 1, 17, 2, 0), 'Claw hammer', 1, Decimal('9.95')),
 (10014, 1001, datetime.datetime(2014, 1, 16, 0, 0), '7.25-in. pwr. saw blade', 1, Decimal('14.99')),
 (10014, 1006, datetime.datetime(2014, 1, 17, 2, 0), 'Hicut chain saw, 16 in.', 1, Decimal('256.99')),
 (10015, 1007, datetime.datetime(2014, 1, 17, 2, 0), '7.25-in. pwr. saw blade', 2, Decimal('14.99')),
 (10015, 1007, datetime.datetime(2014, 1, 17, 2, 0), 'Rat-tail file, 1/8-in. fine', 1, Decimal('4.99')),
 (10018, 1005, datetime.datetime(2014, 1, 17, 1, 0), 'PVC pipe, 3.5-in., 8-ft', 12, Decimal('5.87'))]